Toremetal/RobotCar/ESP32_CameraServer_AP_PoliceCar/ESP32_CameraServer_AP_PoliceCar.cpp
        client->print(" </div> <div id='myDIV'><input id='direction' type='number' value='0' readonly hidden />");
        // left buttons Steering
        //client->print("");
        client->print("<div id='police-car' style='width: 100%;'>");

        client->print("<div id='leftS'><button style='border:unset;box-shadow:unset;background-color:transparent;'></button><br /><button id='left' style='min-width: 38px;' onclick='runFun(this.id)'>&#128659;</button> &nbsp; <button id='straight' onclick='runFun(this.id)'>&#128660;</button> &nbsp; <button id='right' style='transform: rotateY(180deg); min-width: 38px;' onclick='runFun(this.id)'>&#128659;</button><br /><button style='border:unset;box-shadow:unset;background-color:transparent;'></button></div>");

        client->print("<div id='rightS' style='display: grid; width: fit-content; height: fit-content; align-content: center; grid-template-columns: auto; gap: 30px; padding: 10px;'>");
        client->print("<button id='forward' style='background-color:green;' class='button2' onclick='runFun(this.id)'>&#8679;</button>");
        client->print("<button id='stop' style='background-color:red;' class='button2' onclick='runFun(this.id)'>&#128721;</button>");
        client->print("<button id='backward' style='background-color: lightsteelblue;' class='button2' onclick='runFun(this.id)'>&#8681;</button>");
        client->print("</div>");  // div id='rightS'

        client->print("</div>");  // div id='police-car'

        client->print("<div id='bunny' style='width: 100%;' hidden>");
        client->print("<div id='leftS' style='padding-top: 0;'><button style='border:unset;box-shadow:unset;background-color:transparent;margin-top: 0;'></button> &nbsp; <button id='forward' style='margin-top: 0;margin-bottom: 10px;' onclick='runFun(this.id)'>&#8593;</button> &nbsp; <button style='border:unset;box-shadow:unset;background-color:transparent;margin-top: 0;'></button><br /><button id='l' style='min-width: 38px;' onclick='runFun(this.id)'>&#8592;</button> &nbsp; <button id='stop' onclick='runFun(this.id)'>&#128721;</button> &nbsp; <button id='r' style='min-width: 38px;' onclick='runFun(this.id)'>&#8594;</button><br /><button style='border:unset;box-shadow:unset;background-color:transparent;'></button> &nbsp; <button id='backward' onclick='runFun(this.id)'>&#8595;</button> &nbsp; <button style='border:unset;box-shadow:unset;background-color:transparent;'></button></div>");
        client->print("<div id='rightS'><button id='up' style='background-color: lightsteelblue;' class='button2' onclick='runFun(this.id)'>A</button> &nbsp; <button id='down' style='background-color:red;' class='button2' onclick='runFun(this.id)'>B</button><br /><br /><button id='left' style='background-color:green;' class='button2' onclick='runFun(this.id)'>X</button> &nbsp; <button id='right' style='background-color: gold;' class='button2' onclick='runFun(this.id)'>Y</button></div>");
        client->print("</div>");

        client->print("</div><script>const POLICECAR = {");
        client->print("LED: '?c{N:105,D1:4,H:7}',");
        client->print("LEDUP: '?c{N:105,D1:1,H:6}',");
        client->print("LEDDN: '?c{N:105,D1:2,H:5}',");
        client->print("HEADLIGHT: '?c{N:105,D1:3,H:4}',");
        client->print("MODE0STANDBY: '?c{N:100,H:0}',");
        client->print("MODE1LINETRACK: '?c{N:101,D1:1,H:1}',");
        client->print("MODE2FREEROAM: '?c{N:101,D1:2,H:2}',");
        client->print("MODE3FOLLOW: '?c{N:101,D1:3,H:3}',");
        client->print("SLEFT: '?c{N:106,D1:1,H:8}',");
        client->print("SRIGHT: '?c{N:106,D1:2,H:9}',");
        client->print("SUP: '?c{N:106,D1:3,H:10}',");
        client->print("SDOWN: '?c{N:106,D1:4,H:11}',");
        client->print("SCENTER: '?c{N:106,D1:5,H:12}',");
        client->print("STOP: '?c{N:100,H:0}',");  // '?c{N:102,D1:9,H:13}'
        client->print("F: '?c{H:21,N:102,D1:1,D2:',");
        client->print("B: '?c{H:22,N:102,D1:2,D2:',");
        client->print("L: '?c{H:23,N:102,D1:3,D2:',");
        client->print("R: '?c{H:24,N:102,D1:4,D2:',");
        client->print("LF: '?c{H:25,N:102,D1:5,D2:',");
        client->print("LB: '?c{H:26,N:102,D1:6,D2:',");
        client->print("RF: '?c{H:27,N:102,D1:7,D2:',");
        client->print("RB: '?c{H:28,N:102,D1:8,D2:'");
        client->print("};</script>");
        // Script Functions
        client->print("<script>function sBtnChange(lbl) { if (lbl == 's') { document.getElementById('s').hidden = false; document.getElementById('l').hidden = true; document.getElementById('a').hidden = true; document.getElementById('f').hidden = true; } else if (lbl == 'l') { document.getElementById('s').hidden = true; document.getElementById('l').hidden = false; document.getElementById('a').hidden = true; document.getElementById('f').hidden = true; } else if (lbl == 'a') { document.getElementById('s').hidden = true; document.getElementById('l').hidden = true; document.getElementById('a').hidden = false; document.getElementById('f').hidden = true; } else if (lbl == 'f') { document.getElementById('s').hidden = true; document.getElementById('l').hidden = true; document.getElementById('a').hidden = true; document.getElementById('f').hidden = false; }; }</script>");
        client->print("<script>function valcheck(value) {if (value > 250) {document.getElementById('speed').value = '250';} else if (value < 0) {document.getElementById('speed').value = '0';}}</script>");
        client->print("<script>function rot(d) { if (document.getElementById('direction').value != d) { document.getElementById('direction').value = d; document.getElementById('leftS').style ='transform:rotate('+d+'deg)'; } } function runFun(id) {valcheck(document.getElementById('speed').value);switch (id) {");
        // Movement
        client->print("case 'stop':document.getElementById('controllers').src=POLICECAR.STOP;break;");
        client->print("case 'forward':document.getElementById('controllers').src=POLICECAR.F + document.getElementById('speed').value + '}';break;");
        client->print("case 'backward':document.getElementById('controllers').src=POLICECAR.B + document.getElementById('speed').value + '}';break;");
        client->print("case 'l':document.getElementById('controllers').src=POLICECAR.L + document.getElementById('speed').value + '}';break;");
        client->print("case 'r':document.getElementById('controllers').src=POLICECAR.R + document.getElementById('speed').value + '}';break;");

