Toremetal/RobotCar/ESP32_CameraServer_AP_PoliceCar/ESP32_CameraServer_AP_PoliceCar.cpp
        // * Motor Steer
        // client->print("case 'left':document.getElementById('controllers').src='?C{N:102,D1:3,D2:' + document.getElementById('speed').value + '}';rot('-45');break;");
        // client->print("case 'right':document.getElementById('controllers').src='?c{N:102,D1:4,D2:' + document.getElementById('speed').value + '}';rot('45');break;");
        // * Servo Steer L: 1 & 3, R: 2 & 4
        client->print("case 'left':document.getElementById('controllers').src=POLICECAR.SLEFT;rot('-30');break;");
        client->print("case 'right':document.getElementById('controllers').src=POLICECAR.SRIGHT;rot('30');break;");
        client->print("case 'up':document.getElementById('controllers').src=POLICECAR.SUP;break;");
        client->print("case 'down':document.getElementById('controllers').src=POLICECAR.SDOWN;break;");
        client->print("case 'straight':document.getElementById('controllers').src=POLICECAR.SCENTER;rot('0');break;");
        // Modes
        client->print("case 'standby': if (document.getElementById('standby').innerText == 'F') { document.getElementById('standby').innerText = 'S'; sBtnChange('s'); document.getElementById('controllers').src = POLICECAR.MODE0STANDBY; } else if (document.getElementById('standby').innerText == 'S') { document.getElementById('controllers').src = POLICECAR.MODE1LINETRACK; document.getElementById('standby').innerText = 'L'; sBtnChange('l'); } else if (document.getElementById('standby').innerText == 'L') { document.getElementById('controllers').src = POLICECAR.MODE2FREEROAM; document.getElementById('standby').innerText = 'A'; sBtnChange('a'); } else if (document.getElementById('standby').innerText == 'A') { document.getElementById('controllers').src = POLICECAR.MODE3FOLLOW; document.getElementById('standby').innerText = 'F'; sBtnChange('f'); } break;");
        client->print("case 'line':document.getElementById('controllers').src=POLICECAR.MODE1LINETRACK;break;");
        client->print("case 'avoid':document.getElementById('controllers').src=POLICECAR.MODE2FREEROAM;break;");
        client->print("case 'follow':document.getElementById('controllers').src=POLICECAR.MODE3FOLLOW;break;");
        // Lights
        client->print("case 'hLight':document.getElementById('controllers').src=POLICECAR.HEADLIGHT;break;");
        client->print("case 'led':document.getElementById('controllers').src=POLICECAR.LED;break;");
        client->print("case 'brighter':document.getElementById('controllers').src=POLICECAR.LEDUP;break;");
        client->print("case 'dimmer':document.getElementById('controllers').src=POLICECAR.LEDDN;break;");
        // Advanced Settings.
        client->print("case 'framesize':document.getElementById('controllers2').src='http://");
        client->print(wifiIp);
        client->print(":80/control?var=framesize&val=' + document.getElementById('framesize').value;break;");
        client->print("case 'quality': document.getElementById('controllers2').src='http://");
        client->print(wifiIp);
        client->print(":80/control?var=quality&val=' + document.getElementById('quality').value;break;");
        client->print("case 'vflip': if (document.getElementById('vflip').checked) {document.getElementById('controllers2').src='http://");
        client->print(wifiIp);
        client->print(":80/control?var=vflip&val=1'} else {document.getElementById('controllers2').src='http://");
        client->print(wifiIp);
        client->print(":80/control?var=vflip&val=0'} break;");
        client->print("case 'hmirror': if (document.getElementById('hmirror').checked) {document.getElementById('controllers2').src='http://");
        client->print(wifiIp);
        client->print(":80/control?var=hmirror&val=1'} else {document.getElementById('controllers2').src='http://");
        client->print(wifiIp);
        client->print(":80/control?var=hmirror&val=0'} break;");


        client->print("default:document.getElementById('controllers').src=POLICECAR.MODE0STANDBY;break;}}</script>");
        //client->print(wifiIp);
        client->print("<iframe id='controllers' src='/?c{}' style='display:none;' hidden></iframe><iframe id='controllers2' src='http://");
        client->print(wifiIp);
        client->print(":80/control?var=framesize&val=12' style='display:none;' hidden></iframe>");
        client->print("<sup style='font-size:small;color:orange;'>");
        client->print(WiFi.localIP());
        client->print("</sup><button hidden style='width:30px;' name='bunny' title='police-car' onclick='document.getElementById(this.name).hidden=!document.getElementById(this.name).hidden;document.getElementById(this.title).hidden=!document.getElementById(this.title).hidden'>^</button></div></body></html>");
        // The HTTP response ends with another blank line:
        client->println();
      } else {
        client->println("HTTP/1.1 200 OK");
        client->println("Access-Control-Allow-Origin:*");
        client->println("Content-type:text/html");
        client->println();
        // The HTTP response ends with another blank line:
        client->println();
        //client->print("HTTP/1.1\r\nHost:");
        //client->print(wifiLocalIp);
        //client->println("\r\nConnection:close\r\n\r\n");
        //client->print("HTTP/1.1\r\nHost:ToremetalApps\r\nConnection:close\r\n\r\n");
      }
    } else {
      client->flush();
    }
  }

  Serial.printf("");
  Serial2.printf("");
}

void CameraWebServer_AP::SocketServer_Test(void) {
  static bool ED_client = true;
  //if (SerialBT.available()) {
  //Serial.write(SerialBT.read());
  //}
  WiFiClient client = server.available();
  if (client) {
    WA_en = true;
    //ED_client = true;
    Serial.println("[Client connected]");
    //Serial2.println("[Client connected]");
    static String readBuff;
    uint8_t Heartbeat_count = 0;
    bool Heartbeat_status = false;
    bool data_begin = true;
    //bool wifi_client = false;
    while (client.connected()) {
      if (client.available()) {
        char c = client.read();
        if (c == 'G') {
          // if G: local connection filter headers to extract cmd.
          c = '\n';
          readResponse(&client);
        }  // else {
           // Wifi connection: No modification needed.
           //wifi_client = true;
           //}
           //Serial.print(c);
        if (true == data_begin && c == '{') {
          readBuff = "";
          data_begin = false;
        }
        if (false == data_begin && c != ' ') {
          readBuff += c;
        }
        if (false == data_begin && c == '}') {
          data_begin = true;
          if (true == readBuff.equals("{Heartbeat}")) {
            Heartbeat_status = true;
          } else {
            Serial.print(readBuff);
            Serial2.print(readBuff);
          }
          //Serial2.print(readBuff);
          readBuff = "";
        }
      }
      /*if (Serial2.available()) {
        static String sendBuff;
        char c = Serial2.read();
        sendBuff += c;
        if (c == '}') {
          client.print(sendBuff);
          Serial.print(sendBuff);
        }
      }*/

      static unsigned long Heartbeat_time = 0;
      if (millis() - Heartbeat_time > 1000) {
        //client.print("{Heartbeat}");
        if (true == Heartbeat_status) {
          Heartbeat_status = false;
          Heartbeat_count = 0;
        } else if (false == Heartbeat_status) {
          Heartbeat_count += 1;
        }
        if (Heartbeat_count > 3) {
          Heartbeat_count = 0;
          Heartbeat_status = false;
          break;
        }
        Heartbeat_time = millis();
      }
      static unsigned long Test_time = 0;
      if (millis() - Test_time > 1000) {
        Test_time = millis();
        //Serial2.println(WiFi.softAPgetStationNum());
        //if (wifi_client) {
        //Serial2.print("{\"N\":100,\"H\":\"STANDBY\"}");
        break;
        //}
      }
    }
    /*if (wifi_client) {
      if (0 != (WiFi.softAPgetStationNum())) {
        Serial2.print("{\"N\":100,\"H\":\"STANDBY\"}");
      }
    }*/
    client.flush();
    client.stop();
    //Serial.println();
    //Serial.println("{\"N\":100,\"H\":\"STANDBY\"}");
    //Serial2.print("{\"N\":100,\"H\":\"STANDBY\"}");
    Serial.println("[Client disconnected]");
  } else {
    if (ED_client == true) {
      Serial.println("Connect to WiFi: connectWifi:Wifi,Password;");
      ED_client = false;
    }
    static String readBuff;
    if (Serial.available()) {
      while (Serial.available()) {
        char c = Serial.read();
        readBuff += c;
        //Serial.println(readBuff);
        if (readBuff.indexOf("connectWifi:") > -1) {
          String wNet = Serial.readStringUntil(',');
          Serial.read();
          String wPass = Serial.readStringUntil(';');
          if (wNet != "") {
            Serial.print("connecting to WiFi: ");
            Serial.print(wNet);
            Serial.print(" ");
            Serial.println(wPass);
            readBuff = "";
            WiFi.begin(wNet, wPass);
            uint8_t i = 0;
            while (WiFi.status() != WL_CONNECTED) {
              delay500();
              if (WiFi.status() == WL_CONNECTED) {
                WiFi_Connected();
                break;
              }
              i++;
              if (i >= 15) {
                Serial.println("Connection to WiFi not Detected.");
                break;
              }
            }
          }
        } else if (readBuff.indexOf("disconnectWifi") > -1) {
          readBuff = "";
          WiFi.disconnect();
          Serial.println("WiFi disconnected.(ESP32_Serial)");
        }
      }
    } else if (Serial2.available()) {
      while (Serial2.available()) {
        char c = Serial2.read();
        readBuff += c;
        if (readBuff.indexOf("connectWifi:") > -1) {
          String wNet = Serial2.readStringUntil(',');
          Serial2.read();
          String wPass = Serial2.readStringUntil(';');
          if (wPass != "") {
            Serial2.print("connecting to WiFi: ");
            Serial2.print(wNet);
            Serial2.print(" ");
            Serial2.println(wPass);
            readBuff = "";
            WiFi.begin(wNet, wPass);
            uint8_t i = 0;
            while (WiFi.status() != WL_CONNECTED) {
              delay500();
              if (WiFi.status() == WL_CONNECTED) {
                WiFi_Connected();
                break;
              }
              i++;
              if (i >= 15) {
                Serial2.println("Connection to WiFi not Detected.");
                break;
              }
            }
          }
        } else if (readBuff.indexOf("disconnectWifi") > -1) {
          readBuff = "";
          WiFi.disconnect();
          Serial2.println("WiFi disconnected.(2)");
        }
      }
    }
    //if (ED_client == true) {
    //  ED_client = false;
    //delay(700);
    //Serial.println("{\"N\":100,\"H\":\"STANDBY\"}");
    //Serial2.print("{\"N\":100,\"H\":\"STANDBY\"}");
    //}
  }
}

void CameraWebServer_AP::FactoryTest(void) {
  //static String readBuff;
  // String sendBuff;
  //if (Serial2.available()) {
  //char c = Serial2.read();
  // readBuff += c;
  // if (c == '}') {
  //  if (true == readBuff.equals("{BT_detection}")) {
  //Serial2.print("{BT_OK}");
  //Serial.println("Factory...");
  // } else if (true == readBuff.equals("{WA_detection}")) {
  //Serial2.print("{");
  //Serial2.print(wifi_name);  //CameraWebServerAP.wifi_name);
  //Serial2.print("}");
  //Serial.println("Factory...");
  //}
  // readBuff = "";
  // }
  //}
  //{
  if ((WiFi.softAPgetStationNum())) {
    if (true == WA_en) {
      digitalWrite(13, HIGH);
      // Serial.println("{WA_OK}");
      // Serial2.println("{WA_OK}");
      WA_en = false;
    }
  } else {
    //timestamp
    static unsigned long Test_time;
    static bool en = true;
    if (millis() - Test_time > 100) {
      if (false == WA_en) {
        // Serial.println("{WA_NO}");
        // Serial2.println("{WA_NO}");
        WA_en = true;
      }
      if (en == true) {
        en = false;
        digitalWrite(13, HIGH);
      } else {
        en = true;
        digitalWrite(13, LOW);
      }
      Test_time = millis();
    }
  }
  //}
}
